"""
Константы для настройки симуляции радара.

Этот модуль содержит параметры, определяющие количество движущихся целей,
шумовых точек, фонового шума, диапазон радара и количество кадров в анимации.
"""

# Установим количество движущихся целей и шумовых точек
NUM_TARGETS = 10  # Количество движущихся целей
NUM_NOISE = 300    # Общее количество шумовых точек
BACKGROUND_NUM = 1000  # Количество фоновых шумовых точек

# Установим параметры радара
RANGE_MAX = 100  # Максимальное значение диапазона радара

# Устанавливаем количество кадров
FRAMES = 200  # Общее количество кадров в анимации
